Revit 2027 API
NumberingSchema.GetValidCategoriesForNumbering Method
 Gets a list of categories that can be used for a numbering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetValidCategoriesForNumbering(
	Document document
)
Public Shared Function GetValidCategoriesForNumbering (
	document As Document
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetValidCategoriesForNumbering(
	Document^ document
)
static member GetValidCategoriesForNumbering :
        document : Document -> ICollection<ElementId>
Parameters
document Document
 The document where the elements will be numbered.
Return Value
ICollection<ElementId>
 The IDs of all valid categories.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace